// Модуль чила
Math.abs(-20);

// Тригонометрия
Math.sin();
Math.cos();
Math.tan();
Math.atan();

// Логарифм
Math.log();

// Округление
Math.round() // математическое
Math.floor() // округление вниз
Math.ceil() // округление вверх

//  Наибольше и наименьшее число
Math.max(1, 2, 3, 4, 5, 6);
Math.min(1, 2, 3, 4, 5, 6);

// Возведение в степень
Math.pow(10, 3); // 1000
10 ** 3; // аналогично но не везде поддерживается
Math.sqrt(16); // 4, корень квадратный
Math.pow(16, 0.5); // 4

// Случайные числа
Math.random(); // случайное число от 0 до 1
Math.round(Math.random() * 100); // случайное число от 0 до 100
Math.round(Math.random() * 70) + 50; // случайное число от 50 до 120
